Hi @blod001,

I tested with version 1.22.1 and there is no error related to %1.

```terraform
$ terraform plan -out cert 

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_node.node will be created
  + resource "bigip_ltm_node" "node" {
      + address          = "192.168.30.1"
      + connection_limit = 0
      + description      = "Test-Node"
      + dynamic_ratio    = 1
      + id               = (known after apply)
      + monitor          = "/Common/icmp"
      + name             = "/Common/terraform_node1"
      + rate_limit       = "disabled"
      + ratio            = (known after apply)
      + session          = (known after apply)
      + state            = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────

Saved the plan to: cert

To perform exactly these actions, run the following command to apply:
    terraform apply "cert"


$ terraform apply "cert"
bigip_ltm_node.node: Creating...
bigip_ltm_node.node: Creation complete after 0s [id=/Common/terraform_node1]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


$ terraform plan -out cert 
bigip_ltm_node.node: Refreshing state... [id=/Common/terraform_node1]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and
found no differences, so no changes are needed.
```